Updated after technical review. Added Basic Ingest, Location Filtering, and more
